const mongoose = require("mongoose");
const Product = require("./models/Product");
const Category = require("./models/Category");
const Brand = require("./models/Brand");

mongoose
  .connect("mongodb://localhost:27017/odour")
  .then(async () => {
    console.log("Connected to Mongo");

    const category1 = await Category.findOne({ slug: "آرایش-صورت" });
    const category2 = await Category.findOne({ slug: "مراقبت-پوست" });
    const category3 = await Category.findOne({ slug: "مراقبت-مو" });
    const category4 = await Category.findOne({ slug: "عطر-و-ادکلن" });

    const brand2 = await Brand.findOne({ slug: "لورآل" });
    const brand1 = await Brand.findOne({ slug: "شانل" });
    const brand3 = await Brand.findOne({ slug: "میبلین" });
    const brand4 = await Brand.findOne({ slug: "نیوآ" });

    if (!category1) {
      console.error("Category not found");
      return;
    }
    if (!category2) {
      console.error("Category not found");
      return;
    }
    if (!category3) {
      console.error("Category not found");
      return;
    }
    if (!category4) {
      console.error("Category not found");
      return;
    }

    if (!brand1) {
      console.error("Brand not found");
      return;
    }
    if (!brand2) {
      console.error("Brand not found");
      return;
    }
    if (!brand3) {
      console.error("Brand not found");
      return;
    }
    if (!brand4) {
      console.error("Brand not found");
      return;
    }

    const productSeeds = [
      {
        name: "رژ لب مات پریمیوم",
        slug: "رژ-لب-مات-پریمیوم",
        description:
          "رژ لب مایع مات لاکچری با فرمول پیشرفته و کیفیت بی‌نظیر، انتخابی عالی برای خانم‌های شیک‌پوش است. این محصول با بافت کرمی و نرم، به راحتی روی لب‌ها پخش می‌شود و پس از خشک شدن، فینیش مات زیبا و یکنواختی ایجاد می‌کند. فرمول غنی شده با ویتامین E و روغن‌های طبیعی، ضمن ایجاد رنگ زیبا و پوشش کامل، از خشکی لب‌ها جلوگیری می‌کند. این رژ لب تا ۱۲ ساعت بر روی لب‌ها باقی می‌ماند و نیازی به تجدید مکرر ندارد.مناسب برای تمام مناسبت‌ها از جمله استفاده روزانه، مهمانی‌ها و مراسم خاص. رنگ‌بندی متنوع این محصول امکان انتخاب مناسب برای هر سلیقه و تن پوستی را فراهم می‌کند.مناسب برای تمام مناسبت‌ها از جمله استفاده روزانه، مهمانی‌ها و مراسم خاص. رنگ‌بندی متنوع این محصول امکان انتخاب مناسب برای هر سلیقه و تن پوستی را فراهم می‌کند.مناسب برای تمام مناسبت‌ها از جمله استفاده روزانه، مهمانی‌ها و مراسم خاص. رنگ‌بندی متنوع این محصول امکان انتخاب مناسب برای هر سلیقه و تن پوستی را فراهم می‌کند",
        images: [
          "https://ik.imagekit.io/vez3rkmrk/products/17399563912b1d4213b20d6cceb19b98d088da9bea.jpg?updatedAt=1751987030130",
        ],
        price: 320000,
        catName: "آرایش صورت",
        brandName: "لورآل",
        catId: category1._id,
        subCatId: "",
        subCat: "",
        category: category1._id,
        brand: brand1._id,
        countInStock: 5,
        rating: 2,
        isFeatured: true,
        weight: "10",
        colors: "bg-purple-100 text-purple-800",
        reviewsNum: 24,
        lilDescription: "رنگ‌های جذاب و ماندگار با فرمول مخصوص",
        btnColor: "from-purple-600 to-pink-600",
        discount: 15,
      },
      {
        name: "عطر گل یاس پاریسی",
        slug: "عطر-گل-یاس-پاریسی",
        description:
          "رژ لب مایع مات لاکچری با فرمول پیشرفته و کیفیت بی‌نظیر، انتخابی عالی برای خانم‌های شیک‌پوش است. این محصول با بافت کرمی و نرم، به راحتی روی لب‌ها پخش می‌شود و پس از خشک شدن، فینیش مات زیبا و یکنواختی ایجاد می‌کند. فرمول غنی شده با ویتامین E و روغن‌های طبیعی، ضمن ایجاد رنگ زیبا و پوشش کامل، از خشکی لب‌ها جلوگیری می‌کند. این رژ لب تا ۱۲ ساعت بر روی لب‌ها باقی می‌ماند و نیازی به تجدید مکرر ندارد.مناسب برای تمام مناسبت‌ها از جمله استفاده روزانه، مهمانی‌ها و مراسم خاص. رنگ‌بندی متنوع این محصول امکان انتخاب مناسب برای هر سلیقه و تن پوستی را فراهم می‌کند.مناسب برای تمام مناسبت‌ها از جمله استفاده روزانه، مهمانی‌ها و مراسم خاص. رنگ‌بندی متنوع این محصول امکان انتخاب مناسب برای هر سلیقه و تن پوستی را فراهم می‌کند.مناسب برای تمام مناسبت‌ها از جمله استفاده روزانه، مهمانی‌ها و مراسم خاص. رنگ‌بندی متنوع این محصول امکان انتخاب مناسب برای هر سلیقه و تن پوستی را فراهم می‌کند",
        images: [
          "https://ik.imagekit.io/vez3rkmrk/products/174479626057c19604a1169fe1f202acdcb4a890e1.jpg?updatedAt=1751986973908",
        ],
        price: 420000,
        offerPrice: 120000,
        catName: "مراقبت پوست",
        brandName: "شانل",
        catId: category2._id,
        subCatId: "",
        subCat: "",
        category: category2._id,
        brand: brand2._id,
        countInStock: 5,
        rating: 2,
        isFeatured: true,
        weight: "10",
        colors: "bg-blue-100 text-blue-800",
        reviewsNum: 12,
        lilDescription: "آبرسانی عمیق و جوان‌سازی پوست",
        btnColor: "from-blue-600 to-teal-600",
        isNew: true,
      },
      {
        name: "پالت سایه چشم",
        slug: "پالت-سایه-چشم",
        description:
          "رژ لب مایع مات لاکچری با فرمول پیشرفته و کیفیت بی‌نظیر، انتخابی عالی برای خانم‌های شیک‌پوش است. این محصول با بافت کرمی و نرم، به راحتی روی لب‌ها پخش می‌شود و پس از خشک شدن، فینیش مات زیبا و یکنواختی ایجاد می‌کند. فرمول غنی شده با ویتامین E و روغن‌های طبیعی، ضمن ایجاد رنگ زیبا و پوشش کامل، از خشکی لب‌ها جلوگیری می‌کند. این رژ لب تا ۱۲ ساعت بر روی لب‌ها باقی می‌ماند و نیازی به تجدید مکرر ندارد.مناسب برای تمام مناسبت‌ها از جمله استفاده روزانه، مهمانی‌ها و مراسم خاص. رنگ‌بندی متنوع این محصول امکان انتخاب مناسب برای هر سلیقه و تن پوستی را فراهم می‌کند.مناسب برای تمام مناسبت‌ها از جمله استفاده روزانه، مهمانی‌ها و مراسم خاص. رنگ‌بندی متنوع این محصول امکان انتخاب مناسب برای هر سلیقه و تن پوستی را فراهم می‌کند.مناسب برای تمام مناسبت‌ها از جمله استفاده روزانه، مهمانی‌ها و مراسم خاص. رنگ‌بندی متنوع این محصول امکان انتخاب مناسب برای هر سلیقه و تن پوستی را فراهم می‌کند",
        images: [
          "https://ik.imagekit.io/vez3rkmrk/products/1717471580844b2bb3ce18f7a8613276e5d7068716.jpg?updatedAt=1751986979033",
        ],
        price: 320000,
        offerPrice: 150000,
        catName: "مراقبت مو",
        brandName: "میبلین",
        catId: category3._id,
        subCatId: "",
        subCat: "",
        category: category3._id,
        brand: brand3._id,
        countInStock: 5,
        rating: 2,
        isFeatured: true,
        weight: "10",
        colors: "bg-green-100 text-green-800",
        reviewsNum: 76,
        lilDescription: "رایحه‌ای لوکس و جذاب برای مناسبات خاص",
        btnColor: "from-green-600 to-emerald-600",
      },
      {
        name: "سرم هیالورونیک اسید",
        slug: "سرم-هیالورونیک-اسید",
        description:
          "رژ لب مایع مات لاکچری با فرمول پیشرفته و کیفیت بی‌نظیر، انتخابی عالی برای خانم‌های شیک‌پوش است. این محصول با بافت کرمی و نرم، به راحتی روی لب‌ها پخش می‌شود و پس از خشک شدن، فینیش مات زیبا و یکنواختی ایجاد می‌کند. فرمول غنی شده با ویتامین E و روغن‌های طبیعی، ضمن ایجاد رنگ زیبا و پوشش کامل، از خشکی لب‌ها جلوگیری می‌کند. این رژ لب تا ۱۲ ساعت بر روی لب‌ها باقی می‌ماند و نیازی به تجدید مکرر ندارد.مناسب برای تمام مناسبت‌ها از جمله استفاده روزانه، مهمانی‌ها و مراسم خاص. رنگ‌بندی متنوع این محصول امکان انتخاب مناسب برای هر سلیقه و تن پوستی را فراهم می‌کند.مناسب برای تمام مناسبت‌ها از جمله استفاده روزانه، مهمانی‌ها و مراسم خاص. رنگ‌بندی متنوع این محصول امکان انتخاب مناسب برای هر سلیقه و تن پوستی را فراهم می‌کند.مناسب برای تمام مناسبت‌ها از جمله استفاده روزانه، مهمانی‌ها و مراسم خاص. رنگ‌بندی متنوع این محصول امکان انتخاب مناسب برای هر سلیقه و تن پوستی را فراهم می‌کند",
        images: [
          "https://ik.imagekit.io/vez3rkmrk/products/1716949163951f30fa3d07071c04cfb4e0c1a79ac5.jpg?updatedAt=1751986989305",
        ],
        price: 126000,
        catName: "عطر و ادکلن",
        brandName: "نیوآ",
        catId: category4._id,
        subCatId: "",
        subCat: "",
        category: category4._id,
        brand: brand4._id,
        countInStock: 5,
        rating: 2,
        isFeatured: true,
        weight: "10",
        colors: "bg-orange-100 text-orange-800",
        reviewsNum: 98,
        lilDescription: "تقویت و نرمی موهای آسیب‌دیده",
        btnColor: "from-yellow-600 to-orange-600",
      },
      {
        name: "بالم مرطوب‌کننده لب",
        slug: "بالم-مرطوب‌کننده-لب",
        description:
          "رژ لب مایع مات لاکچری با فرمول پیشرفته و کیفیت بی‌نظیر، انتخابی عالی برای خانم‌های شیک‌پوش است. این محصول با بافت کرمی و نرم، به راحتی روی لب‌ها پخش می‌شود و پس از خشک شدن، فینیش مات زیبا و یکنواختی ایجاد می‌کند. فرمول غنی شده با ویتامین E و روغن‌های طبیعی، ضمن ایجاد رنگ زیبا و پوشش کامل، از خشکی لب‌ها جلوگیری می‌کند. این رژ لب تا ۱۲ ساعت بر روی لب‌ها باقی می‌ماند و نیازی به تجدید مکرر ندارد.مناسب برای تمام مناسبت‌ها از جمله استفاده روزانه، مهمانی‌ها و مراسم خاص. رنگ‌بندی متنوع این محصول امکان انتخاب مناسب برای هر سلیقه و تن پوستی را فراهم می‌کند.مناسب برای تمام مناسبت‌ها از جمله استفاده روزانه، مهمانی‌ها و مراسم خاص. رنگ‌بندی متنوع این محصول امکان انتخاب مناسب برای هر سلیقه و تن پوستی را فراهم می‌کند.مناسب برای تمام مناسبت‌ها از جمله استفاده روزانه، مهمانی‌ها و مراسم خاص. رنگ‌بندی متنوع این محصول امکان انتخاب مناسب برای هر سلیقه و تن پوستی را فراهم می‌کند",
        images: [
          "https://ik.imagekit.io/vez3rkmrk/products/17169504292d9b706f9629c9e262ef99a39924b5fd.jpg?updatedAt=1751986992823",
        ],
        price: 560000,
        offerPrice: 544000,
        catName: "آرایش صورت",
        brandName: "لورآل",
        catId: category1._id,
        subCatId: "",
        subCat: "",
        category: category1._id,
        brand: brand1._id,
        countInStock: 5,
        rating: 2,
        isFeatured: true,
        weight: "10",
        colors: "bg-purple-100 text-purple-800",
        reviewsNum: 154,
        lilDescription: "12 رنگ متنوع برای آرایش حرفه‌ای",
        btnColor: "from-purple-600 to-pink-600",
        isNew: true,
      },
      {
        name: "شامپو ترمیم‌ کننده",
        slug: "شامپو-ترمیم‌-کننده",
        description:
          "رژ لب مایع مات لاکچری با فرمول پیشرفته و کیفیت بی‌نظیر، انتخابی عالی برای خانم‌های شیک‌پوش است. این محصول با بافت کرمی و نرم، به راحتی روی لب‌ها پخش می‌شود و پس از خشک شدن، فینیش مات زیبا و یکنواختی ایجاد می‌کند. فرمول غنی شده با ویتامین E و روغن‌های طبیعی، ضمن ایجاد رنگ زیبا و پوشش کامل، از خشکی لب‌ها جلوگیری می‌کند. این رژ لب تا ۱۲ ساعت بر روی لب‌ها باقی می‌ماند و نیازی به تجدید مکرر ندارد.مناسب برای تمام مناسبت‌ها از جمله استفاده روزانه، مهمانی‌ها و مراسم خاص. رنگ‌بندی متنوع این محصول امکان انتخاب مناسب برای هر سلیقه و تن پوستی را فراهم می‌کند.مناسب برای تمام مناسبت‌ها از جمله استفاده روزانه، مهمانی‌ها و مراسم خاص. رنگ‌بندی متنوع این محصول امکان انتخاب مناسب برای هر سلیقه و تن پوستی را فراهم می‌کند.مناسب برای تمام مناسبت‌ها از جمله استفاده روزانه، مهمانی‌ها و مراسم خاص. رنگ‌بندی متنوع این محصول امکان انتخاب مناسب برای هر سلیقه و تن پوستی را فراهم می‌کند",
        images: [
          "https://ik.imagekit.io/vez3rkmrk/products/17252704321b0be443046cbc6334725a9920c70891.jpg?updatedAt=1751986993123",
        ],
        price: 888000,
        offerPrice: 876000,
        catName: "مراقبت پوست",
        brandName: "شانل",
        catId: category2._id,
        subCatId: "",
        subCat: "",
        category: category2._id,
        brand: brand2._id,
        countInStock: 5,
        rating: 2,
        isFeatured: true,
        weight: "10",
        colors: "bg-blue-100 text-blue-800",
        reviewsNum: 87,
        lilDescription: "نرمی و حفاظت طولانی مدت",
        btnColor: "from-blue-600 to-teal-600",
        discount: 30,
      },
      {
        name: "کرم ضد آفتاب",
        slug: "کرم-ضد-آفتاب",
        description:
          "رژ لب مایع مات لاکچری با فرمول پیشرفته و کیفیت بی‌نظیر، انتخابی عالی برای خانم‌های شیک‌پوش است. این محصول با بافت کرمی و نرم، به راحتی روی لب‌ها پخش می‌شود و پس از خشک شدن، فینیش مات زیبا و یکنواختی ایجاد می‌کند. فرمول غنی شده با ویتامین E و روغن‌های طبیعی، ضمن ایجاد رنگ زیبا و پوشش کامل، از خشکی لب‌ها جلوگیری می‌کند. این رژ لب تا ۱۲ ساعت بر روی لب‌ها باقی می‌ماند و نیازی به تجدید مکرر ندارد.مناسب برای تمام مناسبت‌ها از جمله استفاده روزانه، مهمانی‌ها و مراسم خاص. رنگ‌بندی متنوع این محصول امکان انتخاب مناسب برای هر سلیقه و تن پوستی را فراهم می‌کند.مناسب برای تمام مناسبت‌ها از جمله استفاده روزانه، مهمانی‌ها و مراسم خاص. رنگ‌بندی متنوع این محصول امکان انتخاب مناسب برای هر سلیقه و تن پوستی را فراهم می‌کند.مناسب برای تمام مناسبت‌ها از جمله استفاده روزانه، مهمانی‌ها و مراسم خاص. رنگ‌بندی متنوع این محصول امکان انتخاب مناسب برای هر سلیقه و تن پوستی را فراهم می‌کند",
        images: [
          "https://ik.imagekit.io/vez3rkmrk/products/17168929153b6ff3276c9fedbe8f8758dad6001e47.jpg?updatedAt=1751986995912",
        ],
        price: 920000,
        catName: "مراقبت مو",
        brandName: "میبلین",
        catId: category3._id,
        subCatId: "",
        subCat: "",
        category: category3._id,
        brand: brand3._id,
        countInStock: 5,
        rating: 2,
        isFeatured: true,
        weight: "10",
        colors: "bg-green-100 text-green-800",
        reviewsNum: 24,
        lilDescription: "محافظت کامل در برابر اشعه UV",
        btnColor: "from-green-600 to-emerald-600",
      },
    ];

    await Product.insertMany(productSeeds);
    console.log("Products inserted");

    mongoose.disconnect();
  })
  .catch(console.error);
