const mongoose = require("mongoose");
const Product = require("./models/Product");
const Category = require("./models/Category");

mongoose
  .connect("mongodb://localhost:27017/odour")
  .then(async () => {
    console.log("Connected to Mongo");

    const category1 = await Category.findOne({ slug: "آرایش-صورت" });
    const category2 = await Category.findOne({ slug: "مراقبت-پوست" });
    const category3 = await Category.findOne({ slug: "مراقبت-مو" });
    const category4 = await Category.findOne({ slug: "عطر-و-ادکلن" });

    if (!category1) {
      console.error("Category not found");
      return;
    }
    if (!category2) {
      console.error("Category not found");
      return;
    }
    if (!category3) {
      console.error("Category not found");
      return;
    }
    if (!category4) {
      console.error("Category not found");
      return;
    }

    const productSeeds = [
      {
        name: "رژ لب مات پریمیوم",
        slug: "رژ-لب-مات-پریمیوم",
        description:
          "رژ لب مایع مات لاکچری با فرمول پیشرفته و کیفیت بی‌نظیر، انتخابی عالی برای خانم‌های شیک‌پوش است. این محصول با بافت کرمی و نرم، به راحتی روی لب‌ها پخش می‌شود و پس از خشک شدن، فینیش مات زیبا و یکنواختی ایجاد می‌کند. فرمول غنی شده با ویتامین E و روغن‌های طبیعی، ضمن ایجاد رنگ زیبا و پوشش کامل، از خشکی لب‌ها جلوگیری می‌کند. این رژ لب تا ۱۲ ساعت بر روی لب‌ها باقی می‌ماند و نیازی به تجدید مکرر ندارد.مناسب برای تمام مناسبت‌ها از جمله استفاده روزانه، مهمانی‌ها و مراسم خاص. رنگ‌بندی متنوع این محصول امکان انتخاب مناسب برای هر سلیقه و تن پوستی را فراهم می‌کند.مناسب برای تمام مناسبت‌ها از جمله استفاده روزانه، مهمانی‌ها و مراسم خاص. رنگ‌بندی متنوع این محصول امکان انتخاب مناسب برای هر سلیقه و تن پوستی را فراهم می‌کند.مناسب برای تمام مناسبت‌ها از جمله استفاده روزانه، مهمانی‌ها و مراسم خاص. رنگ‌بندی متنوع این محصول امکان انتخاب مناسب برای هر سلیقه و تن پوستی را فراهم می‌کند",
        images: [
          "https://ik.imagekit.io/vez3rkmrk/products/17399563912b1d4213b20d6cceb19b98d088da9bea.jpg?updatedAt=1751987030130",
        ],
        price: 320000,
        offerPrice: 150000,
        catName: "آرایش صورت",
        catId: category1._id,
        subCatId: "",
        subCat: "",
        category: category1._id,
        countInStock: 5,
        rating: 2,
        isFeatured: true,
        weight: "10",
        colors: ["bg-red-500", "bg-pink-500", "bg-purple-500"],
        reviewsNum: 24,
        emoji: "💄",
        lilDescription: "رنگ‌های جذاب و ماندگار با فرمول مخصوص",
        btnColor: "from-purple-600 to-pink-600"
      },
      {
        name: "عطر گل یاس پاریسی",
        slug: "عطر-گل-یاس-پاریسی",
        description:
          "رژ لب مایع مات لاکچری با فرمول پیشرفته و کیفیت بی‌نظیر، انتخابی عالی برای خانم‌های شیک‌پوش است. این محصول با بافت کرمی و نرم، به راحتی روی لب‌ها پخش می‌شود و پس از خشک شدن، فینیش مات زیبا و یکنواختی ایجاد می‌کند. فرمول غنی شده با ویتامین E و روغن‌های طبیعی، ضمن ایجاد رنگ زیبا و پوشش کامل، از خشکی لب‌ها جلوگیری می‌کند. این رژ لب تا ۱۲ ساعت بر روی لب‌ها باقی می‌ماند و نیازی به تجدید مکرر ندارد.مناسب برای تمام مناسبت‌ها از جمله استفاده روزانه، مهمانی‌ها و مراسم خاص. رنگ‌بندی متنوع این محصول امکان انتخاب مناسب برای هر سلیقه و تن پوستی را فراهم می‌کند.مناسب برای تمام مناسبت‌ها از جمله استفاده روزانه، مهمانی‌ها و مراسم خاص. رنگ‌بندی متنوع این محصول امکان انتخاب مناسب برای هر سلیقه و تن پوستی را فراهم می‌کند.مناسب برای تمام مناسبت‌ها از جمله استفاده روزانه، مهمانی‌ها و مراسم خاص. رنگ‌بندی متنوع این محصول امکان انتخاب مناسب برای هر سلیقه و تن پوستی را فراهم می‌کند",
        images: [
          "https://ik.imagekit.io/vez3rkmrk/products/174479626057c19604a1169fe1f202acdcb4a890e1.jpg?updatedAt=1751986973908",
        ],
        price: 420000,
        offerPrice: 120000,
        catName: "مراقبت پوست",
        catId: category2._id,
        subCatId: "",
        subCat: "",
        category: category2._id,
        countInStock: 5,
        rating: 2,
        isFeatured: true,
        weight: "10",
        colors: ["bg-red-500", "bg-pink-500", "bg-purple-500"],
        reviewsNum: 12,
        emoji: "🧴",
        lilDescription: "آبرسانی عمیق و جوان‌سازی پوست"
        btnColor: "from-purple-600 to-pink-600"
      },
      {
        name: "پالت سایه چشم",
        slug: "پالت-سایه-چشم",
        description:
          "رژ لب مایع مات لاکچری با فرمول پیشرفته و کیفیت بی‌نظیر، انتخابی عالی برای خانم‌های شیک‌پوش است. این محصول با بافت کرمی و نرم، به راحتی روی لب‌ها پخش می‌شود و پس از خشک شدن، فینیش مات زیبا و یکنواختی ایجاد می‌کند. فرمول غنی شده با ویتامین E و روغن‌های طبیعی، ضمن ایجاد رنگ زیبا و پوشش کامل، از خشکی لب‌ها جلوگیری می‌کند. این رژ لب تا ۱۲ ساعت بر روی لب‌ها باقی می‌ماند و نیازی به تجدید مکرر ندارد.مناسب برای تمام مناسبت‌ها از جمله استفاده روزانه، مهمانی‌ها و مراسم خاص. رنگ‌بندی متنوع این محصول امکان انتخاب مناسب برای هر سلیقه و تن پوستی را فراهم می‌کند.مناسب برای تمام مناسبت‌ها از جمله استفاده روزانه، مهمانی‌ها و مراسم خاص. رنگ‌بندی متنوع این محصول امکان انتخاب مناسب برای هر سلیقه و تن پوستی را فراهم می‌کند.مناسب برای تمام مناسبت‌ها از جمله استفاده روزانه، مهمانی‌ها و مراسم خاص. رنگ‌بندی متنوع این محصول امکان انتخاب مناسب برای هر سلیقه و تن پوستی را فراهم می‌کند",
        images: [
          "https://ik.imagekit.io/vez3rkmrk/products/1717471580844b2bb3ce18f7a8613276e5d7068716.jpg?updatedAt=1751986979033",
        ],
        price: 320000,
        offerPrice: 150000,
        catName: "مراقبت مو",
        catId: category3._id,
        subCatId: "",
        subCat: "",
        category: category3._id,
        countInStock: 5,
        rating: 2,
        isFeatured: true,
        weight: "10",
        colors: ["bg-red-500", "bg-pink-500", "bg-purple-500"],
        reviewsNum: 76,
        emoji: "🌸",
        lilDescription: "رایحه‌ای لوکس و جذاب برای مناسبات خاص"
      },
      {
        name: "سرم هیالورونیک اسید",
        slug: "سرم-هیالورونیک-اسید",
        description:
          "رژ لب مایع مات لاکچری با فرمول پیشرفته و کیفیت بی‌نظیر، انتخابی عالی برای خانم‌های شیک‌پوش است. این محصول با بافت کرمی و نرم، به راحتی روی لب‌ها پخش می‌شود و پس از خشک شدن، فینیش مات زیبا و یکنواختی ایجاد می‌کند. فرمول غنی شده با ویتامین E و روغن‌های طبیعی، ضمن ایجاد رنگ زیبا و پوشش کامل، از خشکی لب‌ها جلوگیری می‌کند. این رژ لب تا ۱۲ ساعت بر روی لب‌ها باقی می‌ماند و نیازی به تجدید مکرر ندارد.مناسب برای تمام مناسبت‌ها از جمله استفاده روزانه، مهمانی‌ها و مراسم خاص. رنگ‌بندی متنوع این محصول امکان انتخاب مناسب برای هر سلیقه و تن پوستی را فراهم می‌کند.مناسب برای تمام مناسبت‌ها از جمله استفاده روزانه، مهمانی‌ها و مراسم خاص. رنگ‌بندی متنوع این محصول امکان انتخاب مناسب برای هر سلیقه و تن پوستی را فراهم می‌کند.مناسب برای تمام مناسبت‌ها از جمله استفاده روزانه، مهمانی‌ها و مراسم خاص. رنگ‌بندی متنوع این محصول امکان انتخاب مناسب برای هر سلیقه و تن پوستی را فراهم می‌کند",
        images: [
          "https://ik.imagekit.io/vez3rkmrk/products/1716949163951f30fa3d07071c04cfb4e0c1a79ac5.jpg?updatedAt=1751986989305",
        ],
        price: 126000,
        offerPrice: 20000,
        catName: "عطر و ادکلن",
        catId: category4._id,
        subCatId: "",
        subCat: "",
        category: category4._id,
        countInStock: 5,
        rating: 2,
        isFeatured: true,
        weight: "10",
        colors: ["bg-red-500", "bg-pink-500", "bg-purple-500"],
        reviewsNum: 98,
        emoji: "💇‍♀️",
        lilDescription: "تقویت و نرمی موهای آسیب‌دیده"
      },
      {
        name: "بالم مرطوب‌کننده لب",
        slug: "بالم-مرطوب‌کننده-لب",
        description:
          "رژ لب مایع مات لاکچری با فرمول پیشرفته و کیفیت بی‌نظیر، انتخابی عالی برای خانم‌های شیک‌پوش است. این محصول با بافت کرمی و نرم، به راحتی روی لب‌ها پخش می‌شود و پس از خشک شدن، فینیش مات زیبا و یکنواختی ایجاد می‌کند. فرمول غنی شده با ویتامین E و روغن‌های طبیعی، ضمن ایجاد رنگ زیبا و پوشش کامل، از خشکی لب‌ها جلوگیری می‌کند. این رژ لب تا ۱۲ ساعت بر روی لب‌ها باقی می‌ماند و نیازی به تجدید مکرر ندارد.مناسب برای تمام مناسبت‌ها از جمله استفاده روزانه، مهمانی‌ها و مراسم خاص. رنگ‌بندی متنوع این محصول امکان انتخاب مناسب برای هر سلیقه و تن پوستی را فراهم می‌کند.مناسب برای تمام مناسبت‌ها از جمله استفاده روزانه، مهمانی‌ها و مراسم خاص. رنگ‌بندی متنوع این محصول امکان انتخاب مناسب برای هر سلیقه و تن پوستی را فراهم می‌کند.مناسب برای تمام مناسبت‌ها از جمله استفاده روزانه، مهمانی‌ها و مراسم خاص. رنگ‌بندی متنوع این محصول امکان انتخاب مناسب برای هر سلیقه و تن پوستی را فراهم می‌کند",
        images: [
          "https://ik.imagekit.io/vez3rkmrk/products/17169504292d9b706f9629c9e262ef99a39924b5fd.jpg?updatedAt=1751986992823",
        ],
        price: 560000,
        offerPrice: 544000,
        catName: "آرایش صورت",
        catId: category1._id,
        subCatId: "",
        subCat: "",
        category: category1._id,
        countInStock: 5,
        rating: 2,
        isFeatured: true,
        weight: "10",
        colors: ["bg-red-500", "bg-pink-500", "bg-purple-500"],
        reviewsNum: 154,
        emoji: "✨",
        lilDescription: "12 رنگ متنوع برای آرایش حرفه‌ای"
      },
      {
        name: "شامپو ترمیم‌ کننده",
        slug: "شامپو-ترمیم‌-کننده",
        description:
          "رژ لب مایع مات لاکچری با فرمول پیشرفته و کیفیت بی‌نظیر، انتخابی عالی برای خانم‌های شیک‌پوش است. این محصول با بافت کرمی و نرم، به راحتی روی لب‌ها پخش می‌شود و پس از خشک شدن، فینیش مات زیبا و یکنواختی ایجاد می‌کند. فرمول غنی شده با ویتامین E و روغن‌های طبیعی، ضمن ایجاد رنگ زیبا و پوشش کامل، از خشکی لب‌ها جلوگیری می‌کند. این رژ لب تا ۱۲ ساعت بر روی لب‌ها باقی می‌ماند و نیازی به تجدید مکرر ندارد.مناسب برای تمام مناسبت‌ها از جمله استفاده روزانه، مهمانی‌ها و مراسم خاص. رنگ‌بندی متنوع این محصول امکان انتخاب مناسب برای هر سلیقه و تن پوستی را فراهم می‌کند.مناسب برای تمام مناسبت‌ها از جمله استفاده روزانه، مهمانی‌ها و مراسم خاص. رنگ‌بندی متنوع این محصول امکان انتخاب مناسب برای هر سلیقه و تن پوستی را فراهم می‌کند.مناسب برای تمام مناسبت‌ها از جمله استفاده روزانه، مهمانی‌ها و مراسم خاص. رنگ‌بندی متنوع این محصول امکان انتخاب مناسب برای هر سلیقه و تن پوستی را فراهم می‌کند",
        images: [
          "https://ik.imagekit.io/vez3rkmrk/products/17252704321b0be443046cbc6334725a9920c70891.jpg?updatedAt=1751986993123",
        ],
        price: 888000,
        offerPrice: 876000,
        catName: "مراقبت پوست",
        catId: category2._id,
        subCatId: "",
        subCat: "",
        category: category2._id,
        countInStock: 5,
        rating: 2,
        isFeatured: true,
        weight: "10",
        colors: ["bg-red-500", "bg-pink-500", "bg-purple-500"],
        reviewsNum: 87,
        emoji: "💋",
        lilDescription: "نرمی و حفاظت طولانی مدت"
      },
      {
        name: "کرم ضد آفتاب",
        slug: "کرم-ضد-آفتاب",
        description:
          "رژ لب مایع مات لاکچری با فرمول پیشرفته و کیفیت بی‌نظیر، انتخابی عالی برای خانم‌های شیک‌پوش است. این محصول با بافت کرمی و نرم، به راحتی روی لب‌ها پخش می‌شود و پس از خشک شدن، فینیش مات زیبا و یکنواختی ایجاد می‌کند. فرمول غنی شده با ویتامین E و روغن‌های طبیعی، ضمن ایجاد رنگ زیبا و پوشش کامل، از خشکی لب‌ها جلوگیری می‌کند. این رژ لب تا ۱۲ ساعت بر روی لب‌ها باقی می‌ماند و نیازی به تجدید مکرر ندارد.مناسب برای تمام مناسبت‌ها از جمله استفاده روزانه، مهمانی‌ها و مراسم خاص. رنگ‌بندی متنوع این محصول امکان انتخاب مناسب برای هر سلیقه و تن پوستی را فراهم می‌کند.مناسب برای تمام مناسبت‌ها از جمله استفاده روزانه، مهمانی‌ها و مراسم خاص. رنگ‌بندی متنوع این محصول امکان انتخاب مناسب برای هر سلیقه و تن پوستی را فراهم می‌کند.مناسب برای تمام مناسبت‌ها از جمله استفاده روزانه، مهمانی‌ها و مراسم خاص. رنگ‌بندی متنوع این محصول امکان انتخاب مناسب برای هر سلیقه و تن پوستی را فراهم می‌کند",
        images: [
          "https://ik.imagekit.io/vez3rkmrk/products/17168929153b6ff3276c9fedbe8f8758dad6001e47.jpg?updatedAt=1751986995912",
        ],
        price: 920000,
        offerPrice: 310000,
        catName: "مراقبت مو",
        catId: category3._id,
        subCatId: "",
        subCat: "",
        category: category3._id,
        countInStock: 5,
        rating: 2,
        isFeatured: true,
        weight: "10",
        colors: ["bg-red-500", "bg-pink-500", "bg-purple-500"],
        reviewsNum: 24,
        emoji: "☀️",
        lilDescription: "محافظت کامل در برابر اشعه UV"
      },
    ];

    await Product.insertMany(productSeeds);
    console.log("Products inserted");

    mongoose.disconnect();
  })
  .catch(console.error);

// const categorySeeds = [
//   {
//     name: "آرایش صورت",
//     slug: "آرایش صورت",
//     images: [],
//     color: "",
//   },
//   {
//     name: "مراقبت پوست",
//     slug: "مراقبت پوست",
//     images: [],
//     color: "",
//   },
//   {
//     name: "مراقبت مو",
//     slug: "مراقبت مو",
//     images: [],
//     color: "",
//   },
//   {
//     name: "عطر و ادکلن",
//     slug: "عطر و ادکلن",
//     images: [],
//     color: "",
//   },
// ];

// Product.insertMany(productSeeds)
//     .then(p => {
//         console.log("Product successful");
//     })
//     .catch(e => {
//         console.log(e);
//     });

// Category.insertMany(categorySeeds)
//   .then((p) => {
//     console.log("Category successful");
//   })
//   .catch((e) => {
//     console.log(e);
//   });
